Repository: maoschanz/emoji-selector-for-gnome
Catalog: emoji-selector@maestroschan.*/locale/*/LC_MESSAGES/emoji-selector.po
Languages: gl, it

source: Type here to search…
gl: Escriba aquí para buscar…
it: Digita qui per effettuare una ricerca…

source: Emoji Selector
gl: Selector de emoticonas

source: Smileys & Body
gl: Sorrisos e corpo
it: Emoticon & Volti

source: Peoples & Clothing
gl: Xente e roupa
it: Persone & Abiti

source: Animals & Nature
gl: Animais e natureza
it: Animali & Natura

source: Food & Drink
gl: Comida e bevida
it: Cibo & Bevande

source: Travel & Places
gl: Viaxar e lugares
it: Viaggi & Luoghi

source: Activities & Sports
gl: Actividades e deportes
it: Attività & Sport

source: Objects
gl: Obxectos
it: Oggetti

source: Symbols
gl: Símbolos
it: Simboli

source: Flags
gl: Bandeiras
it: Bandiere

source: Modifications will be effective after reloading the extension.
gl: As modificacións faranse efectivas despois de recargar a extensión.
it: Le modifiche diventeranno effettive dopo aver ricaricato l'estensione.

source: From top to bottom
gl: De arriba cara abaixo
it: Dall'alto verso il basso

source: From bottom to top
gl: De abaixo cara arriba
it: Dal basso verso l'alto

source: The default value is %s
gl: O valor por defecto é %s
it: Il valore predefinito è %s

source: version %s
gl: versión %s
it: versione %s

source: Layout
gl: Disposición

source: Displaying the interface from the bottom is better if you use a bottom panel instead of the default top bar. Modifications will be effective after reloading the extension.
gl: Se cambiou o panel á parte inferior da pantalla seguro que quererá usar a interface desde arriba cara abaixo. As modificacións realizaranse despois de recargar a extensión.
it: La visualizzazione dell'interfaccia dal basso è migliore se si utilizza un pannello inferiore invece della barra superiore predefinita. Le modifiche entreranno in vigore dopo il ricaricamento dell'estensione.

source: General layout
gl: Disposición xeral
it: Layout generale

source: Number of emojis per line
gl: Número de emoticonas por liña
it: Numero di emoji per riga

source: Size of emojis (px)
gl: Tamaño das emoticonas (px)
it: Dimensione degli emoji (px)

source: Keyboard bindings
gl: Atallos de teclado
it: Associazioni di tastiera

source: Always show the icon in the panel
gl: Mostrar sempre a icona no panel
it: Mostra sempre l'icona nel pannello

source: If you access the menu with the keyboard shortcut, you don't need to always display the icon.
gl: Se accede ao menú cos atallos de teclado, pode que non queira que se mostre sempre a icona.
it: Se accedi al menu con la scorciatoia da tastiera, non devi sempre visualizzare l'icona.

source: Use a keyboard shortcut to toggle the menu
gl: Usar un atallo de teclado para trocar o menú
it: Usa una scorciatoia da tastiera per mostrare il menu

source: Help
gl: Axuda
it: Aiuto

source: Apply
gl: Aplicar
it: Applica

source: This extension provides a parametrable popup menu displaying most emojis, clicking on an emoji copies it to the clipboard.
gl: Esta extensión fornece un menú despregábel parametrizábel que mostra unha morea de emoticonas, nas que pode premer para copialas por portaretallos.
it: Questa estensione fornisce un menu popup parametrabile che mostra la maggior parte degli emoji, facendo clic su un emoji la copia negli appunti.

source: Report bugs or ideas
gl: Informar de erros ou ideas
it: Segnala bug o idee

source: Author
gl: Autor
it: Autore

source: Translator(s)
gl: Tradutor(es)
it: Traduttore(i)

source: translator-credits
gl: Fran Diéguez <frandieguez@gnome.org>, 2021
it: Albano Battistella, Danilo Del Busso

source: Contributors
gl: Contribuidores
it: Contributori

source: List of valid key names
gl: Lista de nomes de chaves válidas
it: Lista dei nomi chiave validi

source: Modifier keys must be between chevrons
gl: As teclas modificadores deben estar entre cheuróns
it: I tasti di modifica devono essere compresi tra parentesi uncinate

source: Don't use a keyboard shortcut that already exists.
gl: Non use un atallo de teclado que xa existe.
it: Non utilizzare una scorciatoia da tastiera già esistente.

source: Incorrect number of keywords for category '%s':
gl: Número incorrecto de palabras chave para a categoría «%s»:
it: Numero di parole chiave errato per la categoria '%s':

source: Please report this bug
gl: Informe dun erro
it: Segnala questo bug

source: No skin tone
gl: Sen ton de pel
it: Nessun tono della pelle

source: Light skin tone
gl: Ton de pel claro
it: Tonalità della pelle chiara

source: Medium light skin tone
gl: Ton de pel medio claro
it: Tono della pelle medio-leggero

source: Medium skin tone
gl: Ton de pel medio
it: Tonalità della pelle media

source: Medium dark skin tone
gl: Ton de pel medio escuro
it: Tono della pelle medio scuro

source: Dark skin tone
gl: Ton de pel escuro
it: Tonalità della pelle scura

source: Women
gl: Muller
it: Donne

source: Men
gl: Home
it: Uomini

source: About
it: Informazioni
